'''
Создать файл с функциями (на своё усмотрение).
Во втором файле подключить его как библиотеку и запустить функции. 
'''

import modul


print('Выведем несколько функций из собственного модуля, первая функция:')
print('')
print(modul.my_date_mas())
print('')

print('')
print('Второй, под названием "лесенка":')
print(modul.draw_triangle())
